# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Users\jagumiel\Documents\PSoC Creator\LIN-Automotive\3-LIN-Internal-Light-Control\LIN-Internal_Light_Control.cydsn\LIN-Internal_Light_Control.cyprj
# Date: Tue, 21 Jul 2020 11:02:45 GMT
#set_units -time ns
create_clock -name {LINS_IntClk(FFB)} -period 3250 -waveform {0 1625} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyRouted1} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/dsi_in_0}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyIMO} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyHFCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/hfclk}]]
create_clock -name {CySYSCLK} -period 20.833333333333332 -waveform {0 10.4166666666667} [list [get_pins {ClockBlock/sysclk}]]
create_generated_clock -name {Clock_25KHz} -source [get_pins {ClockBlock/hfclk}] -edges {1 1921 3841} [list [get_pins {ClockBlock/udb_div_0}]]
create_generated_clock -name {LINS_IntClk} -source [get_pins {ClockBlock/hfclk}] -edges {1 157 313} [list]


# Component constraints for D:\Users\jagumiel\Documents\PSoC Creator\LIN-Automotive\3-LIN-Internal-Light-Control\LIN-Internal_Light_Control.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Users\jagumiel\Documents\PSoC Creator\LIN-Automotive\3-LIN-Internal-Light-Control\LIN-Internal_Light_Control.cydsn\LIN-Internal_Light_Control.cyprj
# Date: Tue, 21 Jul 2020 11:02:40 GMT
